// 1. 数学运算操作符
// + - * / % **(求幂)
// + 有一边存在字符串就会先把两边都当作字符串再拼接
let test = 1 + "string";
console.log(test);
// 一元运算符的+可以把其他类型转换为数字
console.log(+true); // 1
console.log(+""); // 0

// 2. 赋值运算符 =，这个运算符支持链式使用以及和+,-,*,/,%,**组成原地修改

// 3. 自增自减 ++ --

// 4. 位运算符 & | ! ^ ~ >> << >>>(无符号的右移)

// 5. ,逗号运算符，连用多个语句，将最后一个作为表达式的返回值

// 6. 值的比较，通常推荐使用===和!==，这两个不做类型转换，js的==和!=的类型转换比较复杂

// 7. 比较奇怪的一些比较结果
// alert(null > 0); // (1) false
// alert(null == 0); // (2) false
// alert(null >= 0); // (3) true
// alert( undefined > 0 ); // false (1)
// alert( undefined < 0 ); // false (2)
// alert( undefined == 0 ); // false (3)

// 8. 条件: if else语句或者三元运算符?:

// 9. 逻辑运算 || && !

// 10. 空值合并 ?? 第一个参数不是null或者undefined返回第一个参数不然返回第二个，注意是只认null和undefined的，和||的区别是||是要认falsy值的